Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Munging the diff output
zh_cn: 改写 diff 输出

source: NAME
zh_cn: 名称

source: NOTE: This must be placed between remote and subcommand.
zh_cn: 注意：这必须位于 remote 和 subcommand 之间。

source: NOTES
zh_cn: 注意

source: Name for the new branch.
zh_cn: 新分支的名称。

source: Named file in $GIT_DIR/branches
zh_cn: 在 $GIT_DIR/branches 中指定的文件

source: Named file in $GIT_DIR/remotes
zh_cn: 在 $GIT_DIR/remotes 中指定的文件

source: Named pointers called refs mark interesting points in history.
zh_cn: 称为 refs 的指针标记了历史上的有趣点。

source: Named remote in configuration file
zh_cn: 在配置文件中指定的远程

source: Naming branches, tags, and other references
zh_cn: 命名分支，标签和其他引用

source: Naming commits
zh_cn: 指定提交

source: Nb: it is worth noting that they may be used/overridden by SCMS sitting above Git so take care if using a foreign front-end.
zh_cn: Nb：值得注意的是，它们可能被基于 Git 上面的 SCMS 使用/覆盖，所以如果使用外部前端，请小心。

source: Nevertheless, this may be useful in the future for compensating for some Git bugs or such, therefore such a usage is permitted.
zh_cn: 然而，这可能在将来用于补偿一些 Git 错误等等，因此允许这样的使用。

source: New objects will not be written to these directories.
zh_cn: 新对象不会写入这些目录。

source: Next Steps
zh_cn: 下一步

source: No checkout of HEAD is performed after the clone is complete.
zh_cn: 克隆完成后，不执行检出 HEAD 。

source: No other modifications are made.
zh_cn: 没有其他修改。

source: Normally the branch merged in is the HEAD of the remote repository, but the choice is determined by the branch.<name>.remote and branch.<name>.merge options; see git-config[1] for details.
zh_cn: 通常分支合并的是远程存储库的 HEAD，但选择由 branch.<name>.remote 和 branch.<name>.merge 选项确定；详见 git-config[1] 。

source: Normally, Git has to read the entries in this list and resolve any symlink that might be present in order to compare them with the current directory.
zh_cn: 通常，Git 必须读取此列表中的条目，并解析可能存在的任何符号链接，以便将其与当前目录进行比较。

source: Normally, only files unknown to Git are removed, but if the -x option is specified, ignored files are also removed.
zh_cn: 通常，只有 Git 未知的文件被删除，但是如果指定了 -x 选项，那么也会删除被忽略的文件。

source: Note
zh_cn: 注意

source: Note that --force applies to all the refs that are pushed, hence using it with push.default set to matching or with multiple push destinations configured with remote.*.push may overwrite refs other than the current branch (including local refs that are strictly behind their remote counterpart).
zh_cn: 请注意， --force 适用于所有推送的引用，因此使用 push.default 设置为 matching 或多个推送目的地配置为 remote.*.push 可能会覆盖除当前分支之外的引用(包括严格在其远程对应方之后的本地引用)。

source: Note that git --help ... is identical to git help ... because the former is internally converted into the latter.
zh_cn: 请注意， git --help ... 与 git help ... 相同，因为前者被内部转换为后者。

source: Note that any commits in HEAD which introduce the same textual changes as a commit in HEAD..<upstream> are omitted (i.e., a patch already accepted upstream with a different commit message or timestamp will be skipped).
zh_cn: 请注意，如果 HEAD 中的任何提交，引入了与 HEAD..<upstream> 中某个提交相同的文本更改，该提交将被忽略(即，已经接受上游具有不同提交消息或时间戳的补丁将被跳过)。

source: Note that extra commits can be shown to give a meaningful history.
zh_cn: 请注意，额外的提交可以显示，以提供有意义的历史。

source: Note that older versions of Git used to ignore removed files; use --no-all option if you want to add modified or new files but ignore removed ones.
zh_cn: 请注意，旧版本的 Git 用于忽略删除的文件;如果要添加修改或新文件但忽略删除的文件，请使用 --no-all 选项。

source: Note that omitting the = in git -c foo.bar ... is allowed and sets foo.bar to the boolean true value (just like [foo]bar would in a config file).
zh_cn: 请注意，省略 git -c foo.bar ... 中的 = 是允许的，并将 foo.bar 设置为布尔值 true （就像 [foo]bar）。

source: Note that the argument to --onto and the <upstream> parameter can be any valid commit-ish.
zh_cn: 请注意，--onto 和<upstream>参数可以是任何有效的 commit-ish。

source: Note that the asterisk * is quoted from the shell in this example; this lets Git, and not the shell, expand the pathnames of files and subdirectories under the Documentation/ directory.
zh_cn: 请注意，本示例中 shell 的星号 * 是引用的（译注：加了 \），这让 Git 而不是 shell 扩展了 Documentation/ 目录下的文件和子目录的路径名。

source: Note that the asterisk * is quoted from the shell in this example; this lets the command include the files from subdirectories of Documentation/ directory.
zh_cn: 请注意，本示例中的 shell 星号 * 是引用的，这允许命令包含来自 Documentation/ 目录的子目录的文件。（译注 * 将只匹配目录下的文件，\* 会包括子目录）

source: Note that the latter does not mean maint and everything between master and next; specifically, maint will not be used if it is included in master.
zh_cn: 请注意，后者并不意味着 maint 以及 master 和 next 之间的所有内容。具体而言，如果包含在 master 中，则不会使用 maint 。

source: Note that the listed commits may not necessarily be the list of the direct parent commits if you have limited your view of history: for example, if you are only interested in changes related to a certain directory or file.
zh_cn: 请注意，列出的提交可能不一定是 direct 父提交的列表，如果您限制了您的历史记录视图：例如，如果您只对与某个目录或文件相关的更改感兴趣。

source: Note that these are applied before commit ordering and formatting options, such as --reverse.
zh_cn: 请注意，这些将在提交订单和格式化选项（例如 --reverse ）之前应用。

source: Note that this also affects options like --replace-all and --unset.
zh_cn: 请注意，这也会影响选项，如 --replace-all 和 --unset 。

source: Note that this diff output doesn’t have its lines prefixed with #.
zh_cn: 请注意，此 diff 输出没有前缀为 # 的行。

source: Note that this is currently only implemented for the client side of clones and fetches.
zh_cn: 请注意，目前仅针对客户端进行克隆和提取。

source: Note that this list is non-comprehensive and not necessarily complete.
zh_cn: 请注意，此列表不非全面的，不一定完整。

source: Note that this will create the new branch, but it will not switch the working tree to it; use "git checkout <newbranch>" to switch to the new branch.
zh_cn: 请注意，这将创建新的分支，但不会将工作树切换到它;使用"git checkout <newbranch>"切换到新分支。

source: Note that those entries will then be subject to pruning, and may be impossible to recover (see Examples below for a possible strategy).
zh_cn: 请注意，这些条目将被修剪，并且可能无法恢复(有关可能的策略，请参阅下面的 例子 )。

source: Note that when providing a <pattern>, you must use --list; otherwise the command is interpreted as branch creation.
zh_cn: 请注意，当提供 <pattern> 时，您必须使用 --list ;否则命令被解释为分支创建。

source: Note the quotes around *.c.
zh_cn: 注意 *.c 周围的引号。

source: Note, that it only makes sense to delete remote-tracking branches if they no longer exist in the remote repository or if git fetch was configured not to fetch them again.
zh_cn: 请注意，只有远程仓库中不再存在 git fetch 被配置为不再次获取它们，删除远程跟踪分支才有意义的。

source: Note: git revert is used to record some new commits to reverse the effect of some earlier commits (often only a faulty one).
zh_cn: 注意： git revert 用于记录一些新的提交，以反转一些较早提交的效果(通常只是一个错误的提交)。

source: Note: you can specify the default pretty format in the repository configuration (see git-config[1]).
zh_cn: 注意：您可以在仓库配置中指定默认的漂亮格式(请参见 git-config[1] )。

source: Notes
zh_cn: 注意

source: Now, you will get the rewritten history saved in HEAD.
zh_cn: 现在，您将获得保存在 HEAD 中的重写历史记录。

source: Numerous contributions have come from the Git mailing list <git@vger.kernel.org>.
zh_cn: 众多贡献来自Git邮件列表 <git@vger.kernel.org>.

source: OPTIONS
zh_cn: 选项

source: ORIG_HEAD is set to point at the tip of the branch before the reset.
zh_cn: 在复位前 ORIG_HEAD 设置为指向分支的尖端。

source: OUTPUT
zh_cn: 输出

source: Object Traversal
zh_cn: 对象遍历

source: Object access and manipulation
zh_cn: 对象访问和操作

source: Object storage format
zh_cn: 对象存储格式

source: Obsolete for: index.
zh_cn: 已经过时： index 。

source: Omitting <branch> detaches HEAD at the tip of the current branch.
zh_cn: 省略<branch>分离当前分支的尖端的 HEAD。

source: On Automatic following
zh_cn: 自动跟随

source: On Backdating Tags
zh_cn: 回溯标签

source: On Re-tagging
zh_cn: 重新标记

source: On success, the command returns the exit code 0.
zh_cn: 成功后，该命令返回退出代码 0。

source: One can also modify context lines by staging them for removal (by converting " " to "-") and adding a "+" line with the new content.
zh_cn: 还可以通过转移上下文行来进行删除(通过将" " 转为 "-")并在新内容中添加“+”行。

source: One difference is that during a merge resolution, you cannot use git commit with pathnames to alter the order the changes are committed, because the merge should be recorded as a single commit.
zh_cn: 不同之处在于，在合并解析过程中，您不能使用具有路径名的 git commit 来更改提交的顺序，因为合并应该被记录为单个提交。

source: One or more of the options below may be used to determine the files shown:
zh_cn: 以下一个或多个选项可用于确定显示的文件：

source: One use is to give submodules context about the superproject that invoked it.
zh_cn: 一个用途是给子模块关于调用它的超项目的上下文。

source: Only print error and warning messages; all other output will be suppressed.
zh_cn: 只打印错误和警告信息;所有其他输出将被抑制。

source: Only the existing values that match the regexp are updated or unset.
zh_cn: 只有与正则表达式匹配的现有值会更新或取消设置。

source: Only valid setting is "--unified=??" or "-u??" to set the number of context lines shown when a unified diff is created.
zh_cn: 有效的设置只有 "--unified=??" 或 "-u??" ，设置创建统一差异时显示的上下文行数。

source: Open the diff vs. the index in an editor and let the user edit it.
zh_cn: 在编辑器中打开 diff 与索引，让用户编辑它。

source: Opens an editor to modify the specified config file; either --system, --global, or repository (default).
zh_cn: 打开编辑器修改指定的配置文件; --system ， --global 或仓库(默认)。

source: Operate quietly.
zh_cn: 安静地操作。

source: Option -r causes the remote-tracking branches to be listed, and option -a shows both local and remote branches.
zh_cn: 选项 -r 导致列出远程跟踪分支，选项 -a 显示本地和远程分支。

source: Optional path arguments may be supplied to limit operation to a subset of the working tree.
zh_cn: 可以提供可选路径参数，以将操作限制到工作树的子集。

source: Options related to fetching
zh_cn: 与抓取有关的选项

source: Options related to merging
zh_cn: 与合并相关的选项

source: Or longhand
zh_cn: 或者较长形式

source: Other consecutive asterisks are considered invalid.
zh_cn: 其他连续的星号被视为无效。

source: Other git-related tools may and do use their own variables.
zh_cn: 其他与 git 相关的工具可能会使用自己的变量。

source: Other options are available to control how the manual page is displayed.
zh_cn: 其他选项可用于控制手册页面的显示方式。

source: Other tools
zh_cn: 其他工具

source: Other ways
zh_cn: 其他方法

source: Otherwise <author> is assumed to be a pattern and is used to search for an existing commit by that author (i.e. rev-list --all -i --author=<author>); the commit author is then copied from the first such commit found.
zh_cn: 否则，<author>被假定为模式，用于搜索该作者的现有提交(即 rev-list --all -i --author=<author>);然后从发现的第一个这样的提交中复制提交作者。

source: Otherwise whitespace.
zh_cn: 否则与 whitespace 相同。

source: Otherwise HEAD will be reset to where it was when the rebase operation was started.
zh_cn: 否则 HEAD 将重新设置为在 rebase 操作启动时的位置。

source: Otherwise all tracked files are compared.
zh_cn: 否则所有跟踪的文件都被比较。

source: Otherwise it remains on the current branch.
zh_cn: 否则它将留在当前分支上。

source: Otherwise just a tag reference for the SHA-1 object name of the commit object is created (i.e. a lightweight tag).
zh_cn: 否则，将创建提交对象的 SHA-1对象名称的标签引用(即轻量级标记)。

source: Otherwise, Git treats the pattern as a shell glob suitable for consumption by fnmatch(3) with the FNM_PATHNAME flag: wildcards in the pattern will not match a / in the pathname.
zh_cn: 否则，Git 将模式视为适合 fnmatch(3) 使用 FNM_PATHNAME 标志的 shell glob：模式中的通配符与路径名中的 / 不匹配。

source: Otherwise, all information (including original commit times or merge information) will be preserved.
zh_cn: 否则，将保留所有信息(包括原始提交时间或合并信息)。

source: Otherwise, apply the changes introduced by those commits that are in next but not HEAD to the current branch, creating a new commit for each new change.
zh_cn: 否则，将 next 中但在 HEAD 的提交引入的更改应用于当前分支，为每个新的更改创建一个新的提交。

source: Otherwise, if it refers to a valid commit, your HEAD becomes "detached" and you are no longer on any branch (see below for details).
zh_cn: 否则，如果它引用一个有效的提交，您的 HEAD 变为"分离"，并且您不再处于任何分支(有关详细信息，请参阅下文)。

source: Otherwise, it suffixes the tag name with the number of additional commits on top of the tagged object and the abbreviated object name of the most recent commit.
zh_cn: 否则，它将标签名称与标签对象之上的附加提交数量以及最近提交的缩写对象名称后缀。

source: Output diff in reverse.
zh_cn: 反向输出 diff。

source: Output from git describe; i.e. a closest tag, optionally followed by a dash and a number of commits, followed by a dash, a g, and an abbreviated object name.
zh_cn: 来自 git describe ;即最接近的标签，可选地后跟一个破折号和提交数，后跟一个破折号，一个 g 和一个缩写的对象名称。

source: Output information on each ref
zh_cn: 输出每个引用的信息

source: Output only the names of config variables for --list or --get-regexp.
zh_cn: 仅输出配置变量名称为 --list 或 --get-regexp 。

source: Override earlier --rebase.
zh_cn: 覆盖之前的 --rebase 。

source: Override the author date used in the commit.
zh_cn: 覆盖提交中使用的作者日期。

source: Override the commit author.
zh_cn: 覆盖提交作者。

source: Override the executable bit of the added files.
zh_cn: 覆盖添加文件的可执行位。

source: Override the up-to-date check.
zh_cn: 覆盖最新的检查。

source: Overrides merge.verbosity.
zh_cn: 覆盖 merge.verbosity。

source: PATTERN FORMAT
zh_cn: 模式格式

source: PRETTY FORMATS
zh_cn: 美化的格式化

source: Pack heads and tags for efficient repository access
zh_cn: 打包头和标签用于高效的仓库访问

source: Pack unpacked objects in a repository
zh_cn: 打包仓库中未打包的对象

source: Part of the git[1] suite
zh_cn: 一部分 git[1] 套件

source: Pass a configuration parameter to the command.
zh_cn: 将配置参数传递给命令。

source: Patch workflow
zh_cn: 补丁工作流程

source: Patches can be specified as files, directories (which will send all files in the directory), or directly as a revision list.
zh_cn: 可以将补丁指定为文件，目录(将在目录中发送所有文件)，或直接作为修订列表。

source: Patches, suggestions and comments are welcome.
zh_cn: 欢迎补丁，建议和意见。

source: Patching
zh_cn: 补丁

source: Path to wherever your core Git programs are installed.
zh_cn: 核心 Git 程序的安装路径。

source: Paths in which the change applied cleanly are updated both in the index file and in your working tree.
zh_cn: 更改应用于的文件，在索引文件和工作树中都更新。

source: Paths may need to be prefixed with ‘`-- '’ to separate them from options or the revision range, when confusion arises.
zh_cn: 当混乱出现时，路径可能需要以 ‘`-- '’ 来作为前缀，以将其与选项或修订版本区分开来。

source: Paths relative to the directory prefix will be matched against that pattern using fnmatch(3); in particular, * and ? can match directory separators.
zh_cn: 相对于目录前缀的路径将使用 fnmatch(3) 与该模式匹配;特别是， * 和 ? 可以 匹配目录分隔符。

source: Pathspecs are used on the command line of "git ls-files", "git ls-tree", "git add", "git grep", "git diff", "git checkout", and many other commands to limit the scope of operations to some subset of the tree or worktree.
zh_cn: Pathspecs 用于 "git ls-files"，"git ls-tree"，"git add"，"git grep"，"git diff"，"git checkout" 以及许多其他命令，用来在命令行上限制操作范围到树或工作树的某个子集。

source: Pattern used to limit paths in Git commands.
zh_cn: 用于限制 Git 命令中路径的模式。

source: Patterns are lists of one or more search expressions separated by newline characters.
zh_cn: 模式是由换行符分隔的一个或多个搜索表达式的列表。

source: Patterns in the exclude file are used in addition to those in info/exclude.
zh_cn: 除了 info/exclude 中的模式外，还使用排除文件中的模式。

source: Patterns read from $GIT_DIR/info/exclude.
zh_cn: 从 $GIT_DIR/info/exclude 读取的模式。

source: Patterns read from a .gitignore file in the same directory as the path, or in any parent directory, with patterns in the higher level files (up to the toplevel of the work tree) being overridden by those in lower level files down to the directory containing the file.
zh_cn: 从路径相同目录（或任何父目录）中的 .gitignore 文件读取的模式，较高级别的文件中的模式（上至工作树的顶层）被较低级别文件中的模式覆盖（下至包含该文件的目录）。

source: Patterns read from the command line for those commands that support them.
zh_cn: 从支持 gitignore 命令的命令行读取的模式。

source: Patterns read from the file specified by the configuration variable core.excludesFile.
zh_cn: 从配置变量 core.excludesFile 指定的文件中读取模式。

source: Patterns that begin with a double quote are quoted in C style.
zh_cn: 以双引号开头的模式以 C 风格引用。

source: Patterns which a user wants Git to ignore in all situations (e.g., backup or temporary files generated by the user’s editor of choice) generally go into a file specified by core.excludesFile in the user’s ~/.gitconfig.
zh_cn: 用户希望 Git 在所有情况下忽略的模式(例如，由用户选择的编辑器生成的备份或临时文件)，通常会转到用户的 ~/.gitconfig 中由 core.excludesFile 指定的文件。

source: Patterns which are specific to a particular repository but which do not need to be shared with other related repositories (e.g., auxiliary files that live inside the repository but are specific to one user’s workflow) should go into the $GIT_DIR/info/exclude file.
zh_cn: 特定仓库特定的但不需要与其他相关仓库共享的模式(例如，存储在仓库中但是特定于一个用户工作流程的辅助文件)，应该进入 $GIT_DIR/info/exclude 文件。

source: Patterns which should be version-controlled and distributed to other repositories via clone (i.e., files that all developers will want to ignore) should go into a .gitignore file.
zh_cn: 应该受版本控制及通过克隆分发到其他存储库的模式(即所有开发人员想要忽略的文件)，应该进入 .gitignore 文件。

source: Peek at a remote’s branch, without configuring the remote in your local repository:
zh_cn: 在本地仓库中没有配置远程时，偷看一个远程分支：

source: People needing to do actual development will also want to read Developing with Git and Sharing development with others.
zh_cn: 需要进行实际开发的人也希望阅读 用 Git 开发 和 与他人分享开发 。

source: People who play the Integrator role need to learn some more commands in addition to the above.
zh_cn: 扮演 集成 角色的人除了上述之外，还需要学习更多的命令。

source: Perform the merge and commit the result.
zh_cn: 执行合并并提交结果。

source: Pick out and massage parameters
zh_cn: 挑选和 massage 参数

source: Please consult your ssh documentation for further details.
zh_cn: 请参阅您的 ssh 文档以获取更多详细信息。

source: Please note that this action is not as efficient as the above two actions.
zh_cn: 请注意，此操作不如上述两个操作那么有效。

source: Please see git-commit[1] for alternative ways to add content to a commit.
zh_cn: 请参阅 git-commit[1] ，以了解添加要提交内容的其他方法。

source: Please see gitglossary[7].
zh_cn: 请参阅 gitglossary[7] 。

source: Please see the gitrepository-layout[5] document.
zh_cn: 请参阅 gitrepository-layout[5] 文件。

source: Please see the template pre-rebase hook script for an example.
zh_cn: 请参阅模板的 pre-rebase 钩子脚本作为示例。

source: Plumbing Commands
zh_cn: 底层命令

source: Prefix - to sort in descending order of the value.
zh_cn: 前缀 - 按照值的降序排序。

source: Prepare each commit with its patch in one file per commit, formatted to resemble UNIX mailbox format.
zh_cn: 将每个提交的补丁准备在一个文件中，格式化为类似于 UNIX 邮箱格式。

source: Prepare patches for e-mail submission
zh_cn: 准备补丁以提交电子邮件

source: Prepare to work on top of <commit>, by detaching HEAD at it (see "DETACHED HEAD" section), and updating the index and the files in the working tree.
zh_cn: 准备在<commit>之上工作，通过分离 HEAD(参见"DETACHED HEAD"部分)，并更新索引和工作树中的文件。

source: Pretty-print the contents of <object> based on its type.
zh_cn: 根据其类型，漂亮地打印 <object> 的内容。

source: Pretty-print the contents of the commit logs in a given format, where <format> can be one of oneline, short, medium, full, fuller, email, raw, format:<string> and tformat:<string>.
zh_cn: 以特定格式漂亮地打印提交日志的内容，其中 <format> 可以是 oneline ， short ， medium ， full ， fuller ， email ， raw ，format:<string>和 tformat:<string> 。

source: Print lines matching a pattern
zh_cn: 打印匹配正则的行

source: Print the manpath (see man(1)) for the man pages for this version of Git and exit.
zh_cn: 打印此版本 Git 的手册路径 (见 man(1)) 并退出。

source: Print the path where the Info files documenting this version of Git are installed and exit.
zh_cn: 打印记录此版本的 Git 的信息文件的路径，并退出。

source: Print the path, without trailing slash, where Git’s HTML documentation is installed and exit.
zh_cn: 打印 Git 的 HTML 文档安装路径（不带尾部斜杠）并退出。

source: Prints a list of useful guides on the standard output.
zh_cn: 在标准输出上打印所有有用的指南。

source: Prints all the available commands on the standard output.
zh_cn: 在标准输出上打印所有可用的命令。

source: Prints the Git suite version that the git program came from.
zh_cn: 打印 git 程序的 Git 套件版本。

source: Prints the synopsis and a list of the most commonly used commands.
zh_cn: 打印概要和最常用命令的列表。

source: Problems with rewriting history
zh_cn: 重写历史的问题

source: Produce a merge commit message
zh_cn: 生成合并提交消息

source: Progress is not reported to the standard error stream.
zh_cn: 进度不会报告给标准错误流。

source: Progress status is reported on the standard error stream by default when it is attached to a terminal, unless -q is specified.
zh_cn: 默认情况下，标准错误流在连接到终端时报告进度状态，除非指定 -q 。

source: Provide content or type and size information for repository objects
zh_cn: 提供仓库对象的内容或类型和大小信息

source: Prune all unreachable objects from the object database
zh_cn: 从对象数据库中清除所有无法访问的对象

source: Public Git repositories
zh_cn: 公开 Git 仓库

source: Pulling into a dirty tree
zh_cn: 拉进一棵肮的树

source: Push "matching" branches to origin.
zh_cn: 将"匹配"分支推送到 origin 。

source: Push into another repository.
zh_cn: 推送进另一个仓库。

source: Push objects over Git protocol to another repository
zh_cn: 将对象通过 Git 协议推送到另一个仓库

source: Push objects over HTTP/DAV to another repository
zh_cn: 将对象通过 HTTP / DAV 推送到另一个仓库

source: Push the current branch to the remote ref matching master in the origin repository.
zh_cn: 将当前分支推送到远程 origin 仓库中匹配 master 的引用。

source: Pushing changes to a public repository
zh_cn: 将更改推送到公共仓库

source: Put a backslash ("\") in front of the first hash for patterns that begin with a hash.
zh_cn: 在第一个 # 号前加上反斜杠 ("\") ，表示以 # 号开头的模式。

source: Put a backslash ("\") in front of the first "!" for patterns that begin with a literal "!", for example, "\!important!.txt".
zh_cn: 在第一个 "!" 前加反斜杠 ("\") ，用于以字符 "!" 开头的模式，如 "\!important!.txt" 。

source: Quick reference guides: GitHub Cheat Sheet (PDF) | Visual Git Cheat Sheet (SVG | PNG)
zh_cn: 快速参考指南: GitHub Cheat Sheet (PDF) | 可视化 Git 小抄 (SVG | PNG)

source: RECOVERING FROM UPSTREAM REBASE
zh_cn: 从上游变基恢复

source: REMOVING FILES THAT HAVE DISAPPEARED FROM THE FILESYSTEM
zh_cn: 从文件系统中删除已消失的文件

source: Read githooks[5] for more details about each hook.
zh_cn: 阅读 githooks[5] 了解有关每个钩子的更多细节。

source: Read, modify and delete symbolic refs
zh_cn: 阅读，修改和删除符号引用

source: Reads the supplied diff output (i.e. "a patch") and applies it to files.
zh_cn: 读取提供的差分输出(即"补丁")并将其应用于文件。

source: Reads the tree information given by <tree-ish> into the index, but does not actually update any of the files it "caches".
zh_cn: 将 <tree-ish> 给出的树信息读入索引，但实际上并不是 update "缓存" 的任何文件。

source: Reads tree information into the index
zh_cn: 将树信息读入索引

source: Reapply commits on top of another base tip
zh_cn: 将提交重新应用于另一个的尖端上

source: Rebasing interactively means that you have a chance to edit the commits which are rebased.
zh_cn: 交互式变基意味着您有机会编辑已变基的提交。

source: Receive missing objects from another repository
zh_cn: 从其他仓库接收丢失的对象

source: Receive what is pushed into the repository
zh_cn: 接收被推入仓库的内容

source: Record changes to the repository
zh_cn: 将更改记录到仓库

source: Record only the fact that the path will be added later.
zh_cn: 只记录路径将被添加的事实。

source: Record the pristine state as the first commit in the history.
zh_cn: 将原始状态记录为历史上的第一个提交。

source: Recovering from repository corruption
zh_cn: 从仓库损坏中恢复

source: Recovering lost changes
zh_cn: 恢复丢失的更改

source: Recovering stash entries that were cleared/dropped erroneously
zh_cn: 恢复被错误地清除/删除的隐藏条目

source: Reference
zh_cn: 参考

source: Reference logs, or "reflogs", record when the tips of branches and other references were updated in the local repository.
zh_cn: 当本地仓库中的分支尖端和其他引用的更新时，引用日志或称 "reflogs" 将记录。

source: Reflogs are useful in various Git commands, to specify the old value of a reference.
zh_cn: Reflogs 可用于各种 Git 命令，以指定引用的旧值。

source: Refs with names beginning ref/head/ contain the SHA-1 name of the most recent commit (or "head") of a branch under development.
zh_cn: 以 ref/head/ 开头的引用包含正在开发的分支的最近提交(或"头")的 SHA-1 名称。

source: Register file contents in the working tree to the index
zh_cn: 将工作树中的文件内容注册到索引

source: Regular expression matching is currently case-sensitive and done against a canonicalized version of the key in which section and variable names are lowercased, but subsection names are not.
zh_cn: 正则表达式匹配当前是区分大小写的，并且对于 section 和变量名小写规范版本的 key，但子 section 名称没有。

source: Remote-tracking branches are updated (see the description of <refspec> below for ways to control this behavior).
zh_cn: 远程跟踪分支已更新(有关如何控制此行为，请参阅下面的<refspec>的描述)。

source: Remove a single stash entry from the list of stash entries.
zh_cn: 从储藏条目列表中移除单个的储藏条目。

source: Remove a single stashed state from the stash list and apply it on top of the current working tree state, i.e., do the inverse operation of git stash save.
zh_cn: 从储藏列表中移除一个单独的储藏，并将其应用于当前工作树状态之上，即执行 git stash save 的反向操作。
